base/InformationRegisters/бит_му_УчетнаяПолитика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_му_УчетнаяПолитика</Name>
			<Comment>(БИТ МУ)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_му_ВидыПараметровУчетнойПолитики</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_му_ВидыПараметровУчетнойПолитики</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

base/Enums/бит_му_РасчетРезервовДебиторскойЗадолженности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_РасчетРезервовДебиторскойЗадолженности</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУчетаВыходных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУчетомВыходных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/Enums/бит_му_РасчетРезервовМПЗ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_му_РасчетРезервовМПЗ</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезУчетаВыходных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СУчетомВыходных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

base/InformationRegisters/бит_му_УчетнаяПолитика/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат; 
	КонецЕсли; 	
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		// Проверка на обязательное заполнение параметров.
		Если НЕ (ТипЗнч(Запись.ЗначениеНастройки) = Тип("Булево") 
			ИЛИ ТипЗнч(Запись.ЗначениеНастройки) = Тип("Число")) Тогда
			
			Если НЕ ЗначениеЗаполнено(Запись.ЗначениеНастройки) Тогда
				ТекстСообщения = НСтр("ru = 'Для организации ""%1""  на дату %2 не заполнено значение настройки ""%3""'; 
				                      |en = 'For organization ""%1"" at date %2, the setting value ""%3""'"); 
				ТекстСообщения = СтрШаблон(ТекстСообщения, Запись.Организация, Запись.Период, Запись.Настройка); 
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);							  
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если Запись.Настройка = ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.ВалютаМеждународногоУчета Тогда
			
			Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
				ТекстСообщения = НСтр("ru = 'Настройка ""%1"" может быть указана только для конкретной организации.'; 
				                      |en = 'The setting ""%1"" can only be specified for a specific organization.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Запись.Настройка);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);									  
			КонецЕсли; 
			
			// Проверка возможности редактирования валюты.
			Если бит_му_ОбщегоНазначения.ЕстьДвиженияПоМУ(Запись.Организация) Тогда
				ТекстСообщения = НСтр("ru = 'Для организации ""%1"" обнаружены движения по международному учету. Изменение валюты невозможно.'; 
				                      |en = 'For the organization ""%1"", international accounting movements have been detected. Currency change is not possible.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Запись.Организация);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);							  
			КонецЕсли; 
			
		КонецЕсли;
		
		Если Запись.Настройка = ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.ПромежуточныйСчетДляКонсолидации Тогда
			Если НЕ РегистрыСведений.бит_му_УчетнаяПолитика.РазрешеноРедактироватьПромежуточныйСчетДляКонсолидации(Запись.Организация) Тогда
				ТекстСообщения = НСтр("ru = 'Невозможно назначить промежуточный счет для консолидации. Организация ""%1"" не установлена консолидирующей ни в одном периметре консолидации.'; 
				                      |en = 'You cannot assign an interim account for consolidation. Organization ""%1"" has not been consolidated in any consolidation perimeter.'");
				ТекстСообщения = СтрШаблон(ТекстСообщения, Запись.Организация);
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			КонецЕсли;
		КонецЕсли; 
		
	КонецЦикла; 	
	
КонецПроцедуры // ПередЗаписью()

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ПроверитьКалендарь = Ложь;
	
	Если ЭтотОбъект.Отбор.Настройка.Значение = ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.РасчетРезервовДебиторскойЗадолженности
		ИЛИ ЭтотОбъект.Отбор.Настройка.Значение = ПланыВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики.РасчетРезервовМПЗ Тогда
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Период"	   , ЭтотОбъект.Отбор.Период.Значение);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Отбор.Организация.Значение);
		Запрос.Текст = "ВЫБРАТЬ
		|	Настройки.Ссылка КАК Настройка,
		|	Настройки.ЭтоГруппа,
		|	УчетнаяПолитика.ЗначениеНастройки,
		|	УчетнаяПолитика.ЗначениеНастройки КАК ПервоначальноеЗначение
		|ИЗ
		|	ПланВидовХарактеристик.бит_му_ВидыПараметровУчетнойПолитики КАК Настройки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_УчетнаяПолитика.СрезПоследних(&Период, Организация = &Организация) КАК УчетнаяПолитика
		|		ПО Настройки.Ссылка = УчетнаяПолитика.Настройка
		|
		|УПОРЯДОЧИТЬ ПО
		|	Настройки.Наименование УБЫВ";
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.Настройка.ТипЗначения)
				И (Выборка.Настройка.ТипЗначения.Типы()[0] = Тип("ПеречислениеСсылка.бит_му_РасчетРезервовДебиторскойЗадолженности")
				ИЛИ Выборка.Настройка.ТипЗначения.Типы()[0] = Тип("ПеречислениеСсылка.бит_му_РасчетРезервовМПЗ"))
				И ЗначениеЗаполнено(Выборка.ЗначениеНастройки)
				И (Выборка.ЗначениеНастройки = Перечисления.бит_му_РасчетРезервовДебиторскойЗадолженности.СУчетомВыходных
				ИЛИ Выборка.ЗначениеНастройки = Перечисления.бит_му_РасчетРезервовМПЗ.СУчетомВыходных) Тогда
				
				ПроверитьКалендарь = Истина;
				
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(Выборка.Настройка.ТипЗначения)
				И Выборка.Настройка.ТипЗначения.Типы()[0] = Тип("СправочникСсылка.ПроизводственныеКалендари")
				И НЕ ЗначениеЗаполнено(Выборка.ЗначениеНастройки)
				И ПроверитьКалендарь Тогда
				
				ТекстСообщения = Нстр("ru = 'Необходимо заполнить производственный календарь.'; 
									  |en = 'You must complete the production calendar.'");
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
				Отказ = Истина;
				Возврат;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	КонецЕсли; 
		
	Если Не Отказ Тогда		
		бит_ОбщиеПеременныеСервер.ЗначениеПеременнойУстановить("бит_му_УчетнаяПолитика", 
								бит_ОбщегоНазначения.ЗаполнениеУчетнойПолитикиМУ(), ИСТИНА);		
	КонецЕсли;
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
